// ========== AUTH 模块 1002000000 ==========
export default {
  1002000000: '登录失败，账号密码不正确',
  1002000001: '登录失败，账号被禁用',
  1002000002: '登录频繁，您的账户已被锁定，请{}后重新登录',
  1002000004: '验证码不正确，原因：{}',
  1002000005: '未绑定账号，需要进行绑定',
  1002000006: 'Token 已经过期',
  1002000007: '手机号不存在',

  // ========== 菜单模块 1002001000 ==========
  1002001000: '已经存在该名字的菜单',
  1002001001: '父菜单不存在',
  1002001002: '不能设置自己为父菜单',
  1002001003: '菜单不存在',
  1002001004: '存在子菜单，无法删除',
  1002001005: '父菜单的类型必须是目录或者菜单',

  // ========== 角色模块 1002002000 ==========
  1002002000: '角色不存在',
  1002002001: '已经存在名为【{}】的角色',
  1002002002: '已经存在编码为【{}】的角色',
  1002002003: '不能操作类型为系统内置的角色',
  1002002004: '名字为【{}】的角色已被禁用',
  1002002005: '编码【{}】不能使用',

  // ========== 用户模块 1002003000 ==========
  1002003000: '用户账号已经存在',
  1002003001: '手机号已经存在',
  1002003002: '邮箱已经存在',
  1002003003: '用户不存在',
  1002003004: '导入用户数据不能为空！',
  1002003005: '用户密码校验失败',
  1002003006: '名字为【{}】的用户已被禁用',
  1002003008: '创建用户失败，原因：超过租户最大租户配额({})！',
  1002000008: '密码解密失败',

  // ========== 部门模块 1002004000 ==========
  1002004000: '已经存在该名字的部门',
  1002004001: '父级部门不存在',
  1002004002: '当前部门不存在',
  1002004003: '存在子部门，无法删除',
  1002004004: '不能设置自己为父部门',
  1002004005: '部门中存在员工，无法删除',
  1002004006: '部门({})不处于开启状态，不允许选择',
  1002004007: '不能设置自己的子部门为父部门',

  // ========== 岗位模块 1002005000 ==========
  1002005000: '当前岗位不存在',
  1002005001: '岗位({}) 不处于开启状态，不允许选择',
  1002005002: '已经存在该名字的岗位',
  1002005003: '已经存在该标识的岗位',

  // ========== 字典类型 1002006000 ==========
  1002006001: '当前字典类型不存在',
  1002006002: '字典类型不处于开启状态，不允许选择',
  1002006003: '已经存在该名字的字典类型',
  1002006004: '已经存在该类型的字典类型',
  1002006005: '无法删除，该字典类型还有字典数据',

  // ========== 字典数据 1002007000 ==========
  1002007001: '当前字典数据不存在',
  1002007002: '字典数据({})不处于开启状态，不允许选择',
  1002007003: '已经存在该值的字典数据',

  // ========== 通知公告 1002008000 ==========
  1002008001: '当前通知公告不存在',

  // ========== 短信渠道 1002011000 ==========
  1002011000: '短信渠道不存在',
  1002011001: '短信渠道不处于开启状态，不允许选择',
  1002011002: '无法删除，该短信渠道还有短信模板',

  // ========== 短信模板 1002012000 ==========
  1002012000: '短信模板不存在',
  1002012001: '已经存在编码为【{}】的短信模板',

  // ========== 短信发送 1002013000 ==========
  1002013000: '手机号不存在',
  1002013001: '模板参数({})缺失',
  1002013002: '短信模板不存在',

  // ========== 短信验证码 1002014000 ==========
  1002014000: '验证码不存在',
  1002014001: '验证码已过期',
  1002014002: '验证码已使用',
  1002014003: '验证码不正确',
  1002014004: '超过每日短信发送数量',
  1002014005: '短信发送过于频率',
  1002014006: '手机号已被使用',
  1002014007: '验证码未被使用',

  1002015001: '名字为【{}】的租户已被禁用',
  1002015002: '名字为【{}】的租户已过期',
  1002015003: '系统租户不能进行修改、删除等操作！',
  1002015004: '已经存在该名称的租户',

  1002016000: '租户套餐不存在',
  1002016001: '租户正在使用该套餐，请给租户重新设置套餐后再尝试删除',
  1002016002: '名字为【{}】的租户套餐已被禁用',

  1002017000: '错误码不存在',
  1002017001: '已经存在编码为【{}】的错误码',

  1002018000: '社交授权失败，原因是：{}',
  1002018001: '社交解绑失败，非当前用户绑定',
  1002018002: '社交授权失败，找不到对应的用户',

  1002019000: '系统敏感词在所有标签中都不存在',
  1002019001: '系统敏感词已在标签中存在',

  1002020000: 'OAuth2客户端不存在',
  1002020001: 'OAuth2客户端编号已存在',
  1002020002: 'OAuth2客户端已禁用',
  1002020003: '不支持该授权类型',
  1002020004: '授权范围过大',
  1002020005: '无效r',
  1002020006: '无效cli',

  1002021000: 'cli',
  1002021001: 'r',
  1002021002: 'stat',
  1002021003: 'cod',

  1002022000: 'cod',
  1002022001: 'cod',

  1002023000: '邮箱账号不存在',
  1002023001: '无法删除，该邮箱账号还有邮件模板',

  1002024000: '邮件模版不存在',
  1002024001: '邮件模版cod',

  // 1002025000: "模板参数 {})缺失",
  1002025000: '邮箱不存在',

  1002026000: '站内信模版不存在',
  1002026001: '已经存在编码为【{}】的站内信模板',

  // 1002025000: "模板参数 {})缺失",

  1003001000: '表定义已经存在',
  1003001001: '导入的表不存在',
  1003001002: '导入的字段不存在',
  1003001004: '表定义不存在',
  1003001005: '字段义不存在',
  1003001006: '同步的字段不存在',
  1003001007: '同步失败，不存在改变',
  1003001008: '数据库的表注释未填写',
  1003001009: '数据库的表字段({})注释未填写',

  1001007000: '数据源配置不存在',
  1001007001: '数据源配置不正确，无法进行连接',
}
